nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.h
#ifndef QSPI_DUMMY_DATA
/*! @brief User Configuraiton item dummy data filled into Output signal if there is no Tx data.*/
#define QSPI_DUMMY_DATA (0x00U) /*!< Dummy data used for Tx if there is no txData. */
#endif

/*! @brief Global variable for dummy data value setting. */
extern volatile uint16_t g_u8QueuedSpiDummyData[];

/*!
 * @brief Status return code for the QUEUEDSPI driver. Only used in transactional layer in this driver.
 * @anchor _qspi_status
 */
enum
{
    kStatus_QSPI_Busy       = MAKE_STATUS(kStatusGroup_QUEUEDSPI, 0), /*!< QUEUEDSPI transfer is busy.*/
    kStatus_QSPI_Error      = MAKE_STATUS(kStatusGroup_QUEUEDSPI, 1), /*!< QUEUEDSPI driver error. */
    kStatus_QSPI_Idle       = MAKE_STATUS(kStatusGroup_QUEUEDSPI, 2), /*!< QUEUEDSPI is idle.*/
    kStatus_QSPI_OutOfRange = MAKE_STATUS(kStatusGroup_QUEUEDSPI, 3)  /*!< QUEUEDSPI transfer out of range. */
};

/*! @brief QUEUEDSPI peripheral status flags.*/
enum _qspi_status_flags
{
    kQSPI_TxEmptyFlag    = QSPI_SPSCR_SPTE_MASK, /*!< Transmitter Empty Flag. */
    kQSPI_ModeFaultFlag  = QSPI_SPSCR_MODF_MASK, /*!< Mode Fault Flag. */
    kQSPI_RxOverflowFlag = QSPI_SPSCR_OVRF_MASK, /*!< Receiver Overflow Flag. */
    kQSPI_RxFullFlag     = QSPI_SPSCR_SPRF_MASK, /*!< Receiver Full Flag. */
    kQSPI_AllStatusFlags = kQSPI_TxEmptyFlag | kQSPI_ModeFaultFlag | kQSPI_RxOverflowFlag | kQSPI_RxFullFlag
};

/*! @brief QUEUEDSPI interrupt source */
enum _qspi_interrupt_enable
{
    kQSPI_TxInterruptEnable         = (QSPI_SPSCR_SPTIE_MASK >> 8U), /*!< SPTE interrupt enable.*/
    kQSPI_RxInterruptEnable         = (QSPI_SPSCR_SPRIE_MASK >> 8U), /*!< SPRF interrupt enable.*/
    kQSPI_RxOverFlowInterruptEnable = (QSPI_SPSCR_ERRIE_MASK >> 8U), /*!< Bus error interrupt enable.*/
    kQSPI_AllInterrupts = kQSPI_TxInterruptEnable | kQSPI_RxInterruptEnable | kQSPI_RxOverFlowInterruptEnable
};

/*! @brief options for Slave Select (SSB) signal direction. */
typedef enum _qspi_ss_direction
{
    kQSPI_SlaveSelectDirectionInput =
        0U, /*!< SSB signal as input for slave mode or master mode with Mode fault enabled. */
    kQSPI_SlaveSelectDIrectionOutput = 1U, /*!< SSB signal as output. */
} qspi_ss_direction_t;

/*! @brief logical level for Slave Select (SSB) signal data */
typedef enum _qspi_ss_data_logic_level
{
    kQSPI_SlaveSelectLogicLow  = 0U, /*!< Slave select logic level low */
    kQSPI_SlaveSelectLogicHigh = 1U  /*!< Slave select logic level high */
} qspi_ss_data_logic_level_t;

/*! @brief QUEUEDSPI Transmit FIFO watermark settings.*/
typedef enum _qspi_txfifo_watermark
{
    kQSPI_TxFifoWatermarkEmpty   = 0U, /*!< Transmit interrupt active when Tx FIFO is empty */
    kQSPI_TxFifoWatermarkOneWord = 1U, /*!< Transmit interrupt active when Tx FIFO has one or fewer words available */
    kQSPI_TxFifoWatermarkTwoWord = 2U, /*!< Transmit interrupt active when Tx FIFO has two or fewer words available */
    kQSPI_TxFifoWatermarkThreeWord =
        3U /*!< Transmit interrupt active when Tx FIFO has three or fewer words available */
} qspi_txfifo_watermark_t;

/*! @brief QUEUEDSPI Receive FIFO watermark settings.*/
typedef enum _qspi_rxfifo_watermark
{
    kQSPI_RxFifoWatermarkOneWord   = 0U, /*!< Receive interrupt active when Rx FIFO has at least one word used */
    kQSPI_RxFifoWatermarkTwoWord   = 1U, /*!< Receive interrupt active when Rx FIFO has at least two words used */
    kQSPI_RxFifoWatermarkThreeWord = 2U, /*!< Receive interrupt active when Rx FIFO has at least three words used */
    kQSPI_RxFifowatermarkFull      = 3U  /*!< Receive interrupt active when Rx FIFO is full */
} qspi_rxfifo_watermark_t;

/*! @brief Transfer data width in each frame */
typedef enum _qspi_data_width
{
    kQSPI_Data2Bits  = 1U,  /*!< 2 bits data width */
    kQSPI_Data3Bits  = 2U,  /*!< 3 bits data width */
    kQSPI_Data4Bits  = 3U,  /*!< 4 bits data width */
    kQSPI_Data5Bits  = 4U,  /*!< 5 bits data width */
    kQSPI_Data6Bits  = 5U,  /*!< 6 bits data width */
    kQSPI_Data7Bits  = 6U,  /*!< 7 bits data width */
    kQSPI_Data8Bits  = 7U,  /*!< 8 bits data width */
    kQSPI_Data9Bits  = 8U,  /*!< 9 bits data width */
    kQSPI_Data10Bits = 9U,  /*!< 10 bits data width */
    kQSPI_Data11Bits = 10U, /*!< 11 bits data width */
    kQSPI_Data12Bits = 11U, /*!< 12 bits data width */
    kQSPI_Data13Bits = 12U, /*!< 13 bits data width */
    kQSPI_Data14Bits = 13U, /*!< 14 bits data width */
    kQSPI_Data15Bits = 14U, /*!< 15 bits data width */
    kQSPI_Data16Bits = 15U, /*!< 16 bits data width */
} qspi_data_width_t;

/*! @brief QUEUEDSPI DMA configuration for Transmit and Receive.*/
enum _qspi_dma_enable_flags
{
    kQSPI_DmaRx = 1U, /*!< Receive DMA Enable Flag. */
    kQSPI_DmaTx = 2U, /*!< Transmit DMA Enable Flag. */
};

/*! @brief QUEUEDSPI master or slave mode configuration.*/
typedef enum _qspi_master_slave_mode
{
    kQSPI_Slave  = 0U, /*!< QUEUEDSPI peripheral operates in slave mode.*/
    kQSPI_Master = 1U, /*!< QUEUEDSPI peripheral operates in master mode.*/
} qspi_master_slave_mode_t;

/*! @brief QUEUEDSPI clock polarity configuration.*/
typedef enum _qspi_clock_polarity
{
    kQSPI_ClockPolarityActiveRisingEdge =
        0U, /*!< CPOL=0. Active-high QUEUEDSPI clock (idles low), rising edge of SCLK starts transaction.*/
    kQSPI_ClockPolarityActiveFallingEdge =
        1U /*!< CPOL=1. Active-low QUEUEDSPI clock (idles high), falling edge of SCLK starts transaction.*/
} qspi_clock_polarity_t;

/*! @brief QUEUEDSPI clock phase configuration.*/
typedef enum _qspi_clock_phase
{
    kQSPI_ClockPhaseSlaveSelectHighBetweenWords = 0U, /*!< CPHA=0, Slave Select toggle high during data frames. */
    kQSPI_ClockPhaseSlaveSelectLowBetweenWords  = 1U  /*!< CPHA=1, Slave Select keep low during data frames.*/
} qspi_clock_phase_t;

/*! @brief QUEUEDSPI data shifter direction options for a given CTAR.*/
typedef enum _qspi_data_shift_direction
{
    kQSPI_MsbFirst = 0U, /*!< Data transfers start with most significant bit.*/
    kQSPI_LsbFirst = 1U  /*!< Data transfers start with least significant bit.*/
} qspi_data_shift_direction_t;

/*! @brief QUEUEDSPI master configuration structure with all master configuration fields covered. */
typedef struct _qspi_master_config
{
    /* Baud rate in bit per second */
    uint32_t u32BaudRateBps;      /*!< Baud Rate for QUEUEDSPI. */
    uint32_t u32ClockFrequencyHz; /*<! Clock frequency for peripheral */

    /* Transfer configuration */
    qspi_data_width_t eDataWidth : 4;                /*!< Data width in SPI transfer */
    qspi_clock_polarity_t eClkPolarity : 1;          /*!< Clock polarity. */
    qspi_clock_phase_t eClkPhase : 1;                /*!< Clock phase. */
    qspi_data_shift_direction_t eShiftDirection : 1; /*!< MSB or LSB data shift direction. */
    bool bEnableWiredOrMode : 1; /*!< SPI pin configuration, when enabled the SPI pins are configured as open-drain
                                drivers with the pull-ups disabled. */

    /* Slave Select signal configuration */
    bool bEnableModeFault : 1; /*!< Enable/Disable mode fault detect for Slave Select Signal */
    bool bEnableStrobe : 1;    /*!< Enable/Disable strobe between data frames irrespective of clock pahse setting */
    bool bEnableSlaveSelAutoMode : 1;   /*!< Enable/Disable Slave Select Auto mode.*/
    bool bEnableSlaveSelOpenDrain : 1;  /*!< Enable the open-drain mode of SPI Pins, otherwise Push-Pull */
    uint16_t u16DelayBetweenFrameInCLK; /*!< The delay between frame.*/

