nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.h
    /* FIFO Configuration */
    bool bEnableFIFO : 1;                         /*!< Enable / Disable FIFO for Transmit/Receive */
    qspi_txfifo_watermark_t eTxFIFOWatermark : 2; /*!< Watermark config for Transmit FIFO */
    qspi_txfifo_watermark_t eRxFIFOWatermark : 2; /*!< Watermark config for Receive FIFO */

    /* Power Control */
    bool bEnableStopModeHoldOff : 1; /*<! Enable/Disable hold off stop mode on data transmitting/receiving */

    /* General Configuraiton */
    bool bEnableModule : 1; /*!< Enable / Disable module */

    /* Interrupt / DMA COnfig */
    uint8_t u8Interrupts : 8;     /*!< Interrupt enabled ORed from @ref _qspi_interrupt_enable */
    uint8_t u8DmaEnableFlags : 8; /*!< Configure DMA Enable/Disable for Transmit/Receive */
} qspi_master_config_t;

/*! @brief QUEUEDSPI slave configuration structure with all slave configuration fields covered.*/
typedef struct _qspi_slave_config
{
    /* Transfer configuration */
    qspi_data_width_t eDataWidth : 4;                /*!< Data width in SPI transfer */
    qspi_clock_polarity_t eClkPolarity : 1;          /*!< Clock polarity. */
    qspi_clock_phase_t eClkPhase : 1;                /*!< Clock phase. */
    qspi_data_shift_direction_t eShiftDirection : 1; /*!< MSB or LSB data shift direction. */
    bool bEnableWiredOrMode : 1; /*!< SPI pin configuration, when enabled the SPI pins are configured as open-drain
                                drivers with the pull-ups disabled. */
    bool bEnableModeFault : 1;   /*!< Enable/Disable mode fault detect for Slave Select Signal */

    /* Slave Select Signal */
    bool bEnableSlaveSelOverride : 1; /*!< Enable/Disble override Slave Select (SS) singal with Master/Slave Mode config
                                       */

    /* FIFO Configuration */
    bool bEnableFIFO : 1;                         /*!< Enable / Disable FIFO for Transmit/Receive */
    qspi_txfifo_watermark_t eTxFIFOWatermark : 2; /*!< Watermark config for Transmit FIFO */
    qspi_txfifo_watermark_t eRxFIFOWatermark : 2; /*!< Watermark config for Receive FIFO */

    /* Power Control */
    bool bEnableStopModeHoldOff : 1; /*<! Enable/Disable hold off stop mode on data transmitting/receiving */
    bool bEnableModule : 1;          /*!< Enable/Disable Module */

    /* Interrupt/DMA configuration */
    uint8_t u8Interrupts;
    uint8_t u8DmaEnableFlags; /*!< Configure DMA Enable/Disable for Transmit/Receive */
} qspi_slave_config_t;

/* ==================== Start Of Transactional Layer Definition =================== */
/*! @brief QUEUEDSPI Peripheral Chip Select Polarity configuration.*/
typedef enum _qspi_pcs_polarity_config
{
    kQSPI_PcsActiveHigh = 0U, /*!< Pcs Active High (idles low). */
    kQSPI_PcsActiveLow  = 1U  /*!< Pcs Active Low (idles high). */
} qspi_pcs_polarity_config_t;

/*!
 * @brief transaction layer configuration options for each transaction
 */
enum _qspi_master_transfer_flag
{
    kQSPI_MasterPCSContinous, /*!< Indicates whether the PCS signal de-asserts during transfer between frames, note
                                 this flag should not be used when CPHA is 0. */
    kQSPI_MasterActiveAfterTransfer /*!< Indicates whether the PCS signal is active after the last frame transfer,
                                         note 1. this flag should not be used when CPHA is 0, 2. this flag can only be
                                       used when kQSPI_MasterPCSContinous is used. */
};

/*! @brief QUEUEDSPI transfer state, used internally for transactional layer. */
enum _qspi_transfer_state
{
    kQSPI_Idle = 0x0U, /*!< Nothing in the transmitter/receiver. */
    kQSPI_Busy,        /*!< Transfer queue is not finished. */
    kQSPI_Error        /*!< Transfer error. */
};

/*! @brief QUEUEDSPI master/slave transfer structure.*/
typedef struct _qspi_transfer
{
    void *pTxData;                 /*!< Transmit buffer. */
    void *pRxData;                 /*!< Receive buffer. */
    volatile uint16_t u16DataSize; /*!< Transfer bytes. */
    uint8_t u8ConfigFlags; /*!< Transfer configuration flags; set from @ref _qspi_master_transfer_flag. This is not used
                              in slave transfer. */
} qspi_transfer_t;

/*!
 * @brief Forward declaration of the _qspi_master_handle typedefs.
 */
typedef struct _qspi_master_handle qspi_master_transfer_handle_t;

/*!
 * @brief Completion callback function pointer type.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param psHandle Pointer to the handle for the QUEUEDSPI master.
 * @param eCompletionStatus Success or error code describing whether the transfer completed.
 * @param pUserData Arbitrary pointer-dataSized value passed from the application.
 */
typedef void (*qspi_master_transfer_callback_t)(qspi_master_transfer_handle_t *psHandle,
                                                status_t eCompletionStatus,
                                                void *pUserData);

/*! @brief QUEUEDSPI master transfer handle structure used for transactional API. */
struct _qspi_master_handle
{
    QSPI_Type *base;                         /*!< Base address for the QSPI peripheral */
    qspi_data_width_t eDataWidth;            /*!< The desired number of bits per frame. */
    volatile bool bIsPcsActiveAfterTransfer; /*!< Indicates whether the PCS signal is active after the last frame
                                                 transfer, This is not used in slave transfer.*/

    uint8_t *volatile pu8TxData;                    /*!< Send buffer. */
    uint8_t *volatile pu8RxData;                    /*!< Receive buffer. */
    volatile uint16_t u16RemainingSendByteCount;    /*!< A number of bytes remaining to send.*/
    volatile uint16_t u16RemainingReceiveByteCount; /*!< A number of bytes remaining to receive.*/
    uint16_t u16TotalByteCount;                     /*!< A number of transfer bytes*/

    volatile uint8_t u8State;                   /*!< QUEUEDSPI transfer state, see _qspi_transfer_state.*/
    qspi_master_transfer_callback_t pfCallback; /*!< Completion callback. */
    void *pUserData;                            /*!< Callback user data. */

    volatile uint16_t u16ErrorCount; /*!< Error count for slave transfer, this is not used in master transfer.*/
};

/*!
 * @brief Forward declaration of the _qspi_master_handle typedefs.
 */
typedef struct _qspi_master_handle qspi_slave_transfer_handle_t;

/*!
 * @brief Completion callback function pointer type.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param handle Pointer to the handle for the QUEUEDSPI slave.
 * @param status Success or error code describing whether the transfer completed.
 * @param pUserData Arbitrary pointer-dataSized value passed from the application.
 */
typedef void (*qspi_slave_transfer_callback_t)(qspi_slave_transfer_handle_t *psHandle,
                                               status_t eCompletionStatus,
                                               void *pUserData);
/* ==================== End   Of Transactional Layer Definition =================== */

/**********************************************************************************************************************
 * API
 *********************************************************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif /*_cplusplus*/

/*!
 * @name Module Initialization/Deinitialization
 * @{
 */
/*!
 * @brief Initializes the QUEUEDSPI as Master.
 *
 * Use helpher function QSPI_MasterGetDefaultConfig to get ready-to-use structure.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param psConfig Pointer to the structure qspi_master_config_t.
 */
void QSPI_MasterInit(QSPI_Type *base, const qspi_master_config_t *psConfig);

/*!
 * @brief Helper function to create ready-to-user maste init structure.
 *
 * The purpose of this API is to get the configuration structure initialized for the QSPI_MasterInit.
 * Users may use the initialized structure unchanged in the QSPI_MasterInit or modify the structure
 * before calling the QSPI_MasterInit.
 * Example:
 * @code
 *  qspi_master_config_t sMasterConfig;
 *  QSPI_MasterGetDefaultConfig(&sMasterConfig);
 * @endcode
 * The default values are:
 * Example:
 * @code
    // Parameter provided by user
    psConfig->u32BaudRateBps = u32BaudRateBps;
    psConfig->u32ClockFrequencyHz = u32ClockFreqHz;
    psConfig->eDataWidth = eDataWidth;

