nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_queued_spi.h
    // Default configuration
    psConfig->eClkPolarity = kQSPI_ClockPolarityActiveRisingEdge;
    psConfig->eClkPhase = kQSPI_ClockPhaseSlaveSelectHighBetweenWords;
    psConfig->eShiftDirection = kQSPI_MsbFirst;
    psConfig->u16DelayBetweenFrameInCLK = 1U;
    psConfig->bEnableWiredOrMode = false;
    psConfig->bEnableModeFault = false;
    psConfig->u8DmaEnableFlags = 0U;    // Disable TX/RX Dma
    psConfig->bEnableFIFO = false;
    psConfig->bEnableStopModeHoldOff = false;
    psConfig->u8Interrupts = 0U;
    psConfig->bEnableModule = false;
 * @todo To be added
 * @endcode
 *
 * @param psConfig    pointer to qspi_master_config_t structure.
 * @param u32ClockFreqcyHz  Peripheral clock frequency in Hz
 */
void QSPI_MasterGetDefaultConfig(qspi_master_config_t *psConfig, uint32_t u32ClockFreqHz);

/*!
 * @brief Initializes the QUEUEDSPI as slave.
 *
 * Use helpher function QSPI_SlaveGetDefaultConfig to get ready-to-use structure.
 *
 * @param base          QUEUEDSPI peripheral address.
 * @param psConfig Pointer to the structure qspi_slave_config_t.
 */
void QSPI_SlaveInit(QSPI_Type *base, const qspi_slave_config_t *psConfig);

/*!
 * @brief Set the qspi_slave_config_t structure to default values.
 *
 * The purpose of this API is to get the configuration structure initialized for the QSPI_SlaveInit.
 * Users may use the initialized structure unchanged in the QSPI_SlaveInit or modify the structure
 * before calling the QSPI_SlaveInit.
 * Example:
 * @code
 *  qspi_slave_config_t slaveConfig;
 *  QSPI_SlaveGetDefaultConfig(&slaveConfig);
 * @endcode
 * The default values are:
 * Example:
 * @code
 * @todo
 * @endcode
 *
 * @param psConfig Pointer to the qspi_slave_config_t structure.
 */
void QSPI_SlaveGetDefaultConfig(qspi_slave_config_t *psConfig);

/*!
 * @brief De-initialize the QUEUEDSPI peripheral for either Master or Slave.
 *
 * @param base QUEUEDSPI peripheral address.
 */
void QSPI_Deinit(QSPI_Type *base);

/* @} */

/*!
 * @name Interrupt APIs
 * @{
 */

/*!
 * @brief Enable one or multiple interrupts.
 *
 * This function enable one or multiple interrupts.
 *
 * @note for TX and RX requests, while enabling the interrupt request the DMA request will be disabled as well.
 * Do not use this API while QUEUEDSPI is in running state.
 *
 * @param base          QUEUEDSPI peripheral address.
 * @param u16Interrupts The interrupt mask which is ORed by the @ref _qspi_interrupt_enable.
 */
static inline void QSPI_EnableInterrupts(QSPI_Type *base, uint16_t u16Interrupts)
{
    if (u16Interrupts != 0U)
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) | (u16Interrupts << 8U);
    }
}

/*!
 * @brief Disable one or multiple interrupts.
 *
 * This function
 *
 * @param base QUEUEDSPI peripheral address.
 * @param u16Interrupts The interrupt mask which is ORed by the @ref _qspi_interrupt_enable.
 */
static inline void QSPI_DisableInterrupts(QSPI_Type *base, uint16_t u16Interrupts)
{
    if (u16Interrupts != 0U)
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) & ~(u16Interrupts << 8U);
    }
}

/* @} */

/*!
 * @name DMA Operation APIs
 * @{
 */

/*!
 * @brief Enable one or multiple DMA
 *
 * Note that if the DMA is enabled for Transmit or Receive, make sure the interurpt is disabled for Transmit or Receive.
 *
 * @param base      QUEUEDSPI peripheral address.
 * @param u8DmaFlags DMA Flags ORed from @ref _qspi_dma_enable_flags.
 */
static inline void QSPI_EnableDMA(QSPI_Type *base, uint8_t u8DmaFlags)
{
    base->SPDSR = base->SPDSR | (((uint16_t)u8DmaFlags) << QSPI_SPDSR_RDMAEN_SHIFT);
}

/*!
 * @brief Enable one or multiple DMA
 *
 * Note that if the DMA is enabled for Transmit or Receive, make sure the interurpt is disabled for Transmit or Receive.
 *
 * @param base      QUEUEDSPI peripheral address.
 * @param u8DmaFlags DMA Flags ORed from @ref _qspi_dma_enable_flags.
 */
static inline void QSPI_DisableDMA(QSPI_Type *base, uint8_t u8DmaFlags)
{
    base->SPDSR = base->SPDSR & ~(((uint16_t)u8DmaFlags) << QSPI_SPDSR_RDMAEN_SHIFT);
}

/*!
 * @brief Get the QUEUEDSPI transmit data register address for the DMA operation.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return The QUEUEDSPI master PUSHR data register address.
 */
static inline uint32_t QSPI_GetTxRegisterAddress(QSPI_Type *base)
{
    return (uint32_t)(uint8_t *)&(base->SPDTR);
}

/*!
 * @brief Get the QUEUEDSPI receive data register address for the DMA operation.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return The QUEUEDSPI POPR data register address.
 */
static inline uint32_t QSPI_GetRxRegisterAddress(QSPI_Type *base)
{
    return (uint32_t)(uint8_t *)&(base->SPDRR);
}

/* @} */

/*!
 * @name Status Get/Clear APIs
 * @{
 */

/*!
 * @brief Get the QUEUEDSPI status flag state.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return QUEUEDSPI status.
 */
static inline uint16_t QSPI_GetStatusFlags(QSPI_Type *base)
{
    return (base->SPSCR & (QSPI_SPSCR_SPTE_MASK | QSPI_SPSCR_OVRF_MASK | QSPI_SPSCR_SPRF_MASK));
}

/*!
 * @brief Clear the status flag only for the mode fault
 *
 * Clear the status flag only for mode fault. @note only kQSPI_ModeFaultFlag can be cleared by this
 * API.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param u16StatusFlags status flags ORed from @ref _qspi_status_flags
 */
static inline void QSPI_ClearStatusFlags(QSPI_Type *base, uint16_t u16StatusFlags)
{
    assert(u16StatusFlags == kQSPI_ModeFaultFlag);

    base->SPSCR |= (uint16_t)kQSPI_ModeFaultFlag;
}

/* @} */

/*!
 * @name QUEUESPI Configuration
 * @{
 */
/*!
 * @brief Enable or disable the QUEUEDSPI peripheral.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable true to enable module, otherwise disable module
 */
static inline void QSPI_Enable(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) | QSPI_SPSCR_SPE_MASK;
    }
    else
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) & ~QSPI_SPSCR_SPE_MASK;
    }
}

/*!
 * @brief Set the QUEUEDSPI baud rate in bits-per-second.
 *
 * This function takes in the desired baud rate, calculates the nearest possible baud rate,
 * and returns the calculated baud rate in bits-per-second.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param u32BaudRateBps The desired baud rate in bits-per-second.
 * @param u32SrcClockHz Module source input clock in Hertz.
 * @return The actual calculated baud rate.
 */
uint32_t QSPI_MasterSetBaudRate(QSPI_Type *base, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz);

/*!
 * @brief Set the QUEUEDSPI as master or slave.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param eMode Mode setting of type qspi_master_slave_mode_t.
 */
static inline void QSPI_SetMasterSlaveMode(QSPI_Type *base, qspi_master_slave_mode_t eMode)
{
    base->SPSCR = base->SPSCR & ~(QSPI_SPSCR_SPMSTR_MASK | QSPI_SPSCR_MODF_MASK) | QSPI_SPSCR_SPMSTR((uint16_t)eMode);
}

/*!
 * @brief Return whether the QUEUEDSPI module is in master mode.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return Returns true if the module is in master mode or false if the module is in slave mode.
 */
static inline bool QSPI_IsMaster(QSPI_Type *base)
{
    return (0U != ((base->SPSCR) & QSPI_SPSCR_SPMSTR_MASK));
}

/*!
 * @brief Set Data Shift Order as MSB first or LSB first
 *
 * @param base QUEUEDSPI peripheral address.
 * @param eDataShiftOrder MSB or LSB first from @ref _qspi_shift_direction
 */
static inline void QSPI_SetDataShiftOrder(QSPI_Type *base, qspi_data_shift_direction_t eDataShiftOrder)
{
    if (eDataShiftOrder == kQSPI_MsbFirst)
    {
        base->SPSCR &= ~(QSPI_SPSCR_MODF_MASK | QSPI_SPSCR_DSO_MASK);
    }
    else
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) | QSPI_SPSCR_DSO_MASK;
    }
}

/*!
 * @brief Enable/Disable mode fault detection
 *
 * If enable, allows the kQSPI_ModeFaultFlag flag to be set. If the kQSPI_ModeFaultFlag flag is set,
 * disable the Mod detection does not clear the flag. If the mod detection is disabled, the level of the SS_B
 * pin does not affect the operation of an enabled SPI configured as a master. If configured as a master and
 * mod fault detection is enabled, a transaction in progress will stop if SS_B goes low.
 * For an enabled SPI configured as a slave, having this feature disabled only prevents the flag from being
 * set. It does not affect any other part of SPI operation
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable true to enable Mode Fault detection, false to disable
 */
static inline void QSPI_EnableModeFault(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) | QSPI_SPSCR_MODFEN_MASK;
    }
    else
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) & ~QSPI_SPSCR_MODFEN_MASK;
    }
}

/*!
 * @brief Set clock polarity
 *
 * @note module shall be disabled before change the polarity by calling QSPI_Enable.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param ePolarity clock polarity option
 */
static inline void QSPI_SetClockPolarity(QSPI_Type *base, qspi_clock_polarity_t ePolarity)
{
    if (ePolarity == kQSPI_ClockPolarityActiveFallingEdge)
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) | QSPI_SPSCR_CPOL_MASK;
    }
    else
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) & ~QSPI_SPSCR_CPOL_MASK;
    }
}

/*!
 * @brief Set clock phase
 *
 * Configure whether get the Slave Select signal toggle high during 2 data frames. Get the SS toggle high
 * between data frames will lead to SPI to be trigged with transaction for the falling edge of SS signal.
 * Otherwise, the data transaction is started on the first active SCLK edge.
 *
 * @note module shall be disabled before change the polarity by calling QSPI_Enable.
 * @note Do not use kQSPI_ClockPhaseSlaveSelectHighBetweenWords in DMA mode.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param eClockPhase Option for clock phase
 */
static inline void QSPI_SetClockPhase(QSPI_Type *base, qspi_clock_phase_t eClockPhase)
{
    if (eClockPhase == kQSPI_ClockPhaseSlaveSelectHighBetweenWords)
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) & ~QSPI_SPSCR_CPHA_MASK;
    }
    else
    {
        base->SPSCR = base->SPSCR & (~QSPI_SPSCR_MODF_MASK) | QSPI_SPSCR_CPHA_MASK;
    }
}

/*!
 * @brief Enable/Disable Wired OR mode for SPI pins which means open-drain when enabled and push-pull when disabled
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable true to configure SPI pins as open-drain, false to configure as push-pull
 */
static inline void QSPI_EnableWiredORMode(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPDSR |= QSPI_SPDSR_WOM_MASK;
    }
    else
    {
        base->SPDSR &= ~QSPI_SPDSR_WOM_MASK;
    }
}

/*!
 * @brief Set the transaction data width
 *
 * @param base QUEUEDSPI peripheral address.
 * @param eDataWidth datawidth for bits in each data frame.
 */
static inline void QSPI_SetTransactionDataSize(QSPI_Type *base, qspi_data_width_t eDataWidth)
{
    base->SPDSR = base->SPDSR & (~QSPI_SPDSR_DS_MASK) | eDataWidth;
}

/*!
 * @brief For master mode, set wait delay in clock cycle with delay is set value + 1 peripheral bus clock
 *
 * This controls the time between data transactions in master mode. Delay will not be added if no word is waiting
 * for transmitting.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param u16WaitDelayInPeriClockCount Clock count for the delay during data frames
 */
static inline void QSPI_MasterSetWaitDelay(QSPI_Type *base, uint16_t u16WaitDelayInPeriClockCount)
{
    base->SPWAIT = u16WaitDelayInPeriClockCount;
}

/*!
 * @brief Enable/Disable hold off entry to stop mode is a word is being transmitted/received for Master Mode
 *
 * When enabled, this bit allows the SPI module to hold off entry to chip level stop mode if a word is being
 * transmitted or received. Stop mode will be entered after the SPI finishes transmitting/receiving. This bit
 * does not allow the SPI to wake the chip from stop mode in any way. The SHEN bit can only delay the
 * entry into stop mode. This bit should not be set in slave mode because the state of SS_B (which would be
 * controlled by an external master device) may cause the logic to hold off stop mode entry forever.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable true to enable hold-off entrying stop mode if there is transmitting/receiving
 */
static inline void QSPI_EnableStopModeHoldOff(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPCTL2 = 1U;
    }
    else
    {
        base->SPCTL2 = 0U;
    }
}

/*!
 * @brief Helper function exported for QSPI DMA driver
 *
 * Get the instance index from the base address. User need not understand this function.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return uint32_t Index of the peripheral instance for given base address.
 */
uint32_t QSPI_GetInstance(QSPI_Type *base);

/* @} */

/*!
 * @name Slave Select (SS) singal
 * @{
 */

/*!
 * @brief For master mode, get the SS_B input logic level while true means drive High and false means drive Low
 *
 * Get the value to drive on the SS_B pin. This bit is disabled when SSB_AUTO=1 or SSB_STRB=1. Only apply for Master
 * mode.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return true SS_B input level High
 * @return false  SS_B input level Low
 */
static inline qspi_ss_data_logic_level_t QSPI_MasterGetSlaveSelectLogicLevel(QSPI_Type *base)
{
    return ((base->SPDSR & QSPI_SPDSR_SSB_IN_MASK) == 0U) ? kQSPI_SlaveSelectLogicLow : kQSPI_SlaveSelectLogicHigh;
}

/*!
 * @brief for master mode, drive Slave Select pin logic high or low
 *
 * This feature is disabled if Slave Select automatic mode is enabled or Slave Select Strobe feature is enabled
 *
 * @param base QUEUEDSPI peripheral address.
 * @param eLogicLevel  logic level
 */
static inline void QSPI_MasterSetSlaveSelectLogicLevel(QSPI_Type *base, qspi_ss_data_logic_level_t eLogicLevel)
{
    if (eLogicLevel == kQSPI_SlaveSelectLogicHigh)
    {
        base->SPDSR |= QSPI_SPDSR_SSB_DATA_MASK;
    }
    else
    {
        base->SPDSR &= ~QSPI_SPDSR_SSB_DATA_MASK;
    }
}

/*!
 * @brief For master mode, Enable open drain in SSB pad pin
 *
 * Enable it means SS_B is configured for high and low drive. This mode is generally used in single master systems.
 * Disable it means SS_B is configured as an open drain pin (only drives low output level). This mode is useful for
 * multiple master systems
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable Enable/Disable option.
 */
static inline void QSPI_MasterEnableSlaveSelectOpenDrainMode(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPDSR |= QSPI_SPDSR_SSB_ODM_MASK;
    }
    else
    {
        base->SPDSR &= ~QSPI_SPDSR_SSB_ODM_MASK;
    }
}

/*!
 * @brief For master mode, Enable/Disable Slave Select pin automatic mode
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable Enable/Disable option.
 */
static inline void QSPI_MasterEnableSlaveSelectAutomaticMode(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPDSR |= QSPI_SPDSR_SSB_AUTO_MASK;
    }
    else
    {
        base->SPDSR &= ~QSPI_SPDSR_SSB_AUTO_MASK;
    }
}

/*!
 * @brief Set Input/Output mode for SSB signal
 *
 * @param base QUEUEDSPI peripheral address.
 * @param eDirection options from @ref _qspi_ssb_direction
 */
static inline void QSPI_SetSlaveSelectDirection(QSPI_Type *base, qspi_ss_direction_t eDirection)
{
    if (eDirection == kQSPI_SlaveSelectDIrectionOutput)
    {
        base->SPDSR |= QSPI_SPDSR_SSB_DDR_MASK;
    }
    else
    {
        base->SPDSR &= ~QSPI_SPDSR_SSB_DDR_MASK;
    }
}

/*!
 * @brief For master, set strobe mode for SSB signal
 *
 * If enabled, Slave select pulse high during data frames irrespective of Clock Phase configuration
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable Enable/Disable option.
 */
static inline void QSPI_MasterEnableSlaveSelectStrobe(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPDSR |= QSPI_SPDSR_SSB_STRB_MASK;
    }
    else
    {
        base->SPDSR &= ~QSPI_SPDSR_SSB_STRB_MASK;
    }
}

/*!
 * @brief Enable / Disable SSB signal from Master/Slave configuration or GPIO pin state
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable Enable/Disable option.
 */
static inline void QSPI_EnableSlaveSelectOverride(QSPI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SPDSR |= QSPI_SPDSR_SSB_OVER_MASK;
    }
    else
    {
        base->SPDSR &= ~QSPI_SPDSR_SSB_OVER_MASK;
    }
}

/* @} */

/*!
 * @name Transmit/Receive Bus Operation
 * @{
 */

/*!
 * @brief Set up the dummy data used when there is not transmit data provided.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param u8DummyData Data to be transferred when tx buffer is NULL.
 */
void QSPI_SetDummyData(QSPI_Type *base, uint8_t u8DummyData);

/*!
 * @brief Get the dummy data for each peripheral
 *
 * @param base QUEUEDSPI peripheral base address.
 */
uint8_t QSPI_GetDummyData(QSPI_Type *base);

/*!
 * @brief Write data into the transmit data register without polling the status of shifting
 *
 * @param base QUEUEDSPI peripheral address.
 * @param data The data to send.
 */
static inline void QSPI_WriteData(QSPI_Type *base, uint16_t data)
{
    base->SPDTR = data;
}

/*!
 * @brief Read data from the receive data register
 *
 * @param base QUEUEDSPI peripheral address.
 * @return The data from the receive data register.
 */
static inline uint16_t QSPI_ReadData(QSPI_Type *base)
{
    return base->SPDRR;
}

/* @} */

/*!
 * @name FIFO Operation APIs
 * @{
 */

/*!
 * @brief Enable or disable the QUEUEDSPI FIFOs.
 *
 * This function allows the caller to disable or enable the TX and RX FIFOs together.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param bEnable Pass true to enable, pass false to disable
 */
static inline void QSPI_EnableFifo(QSPI_Type *base, bool bEnable)
{
    base->SPFIFO = (base->SPFIFO & (~QSPI_SPFIFO_FIFO_ENA_MASK)) | QSPI_SPFIFO_FIFO_ENA((uint16_t)bEnable);
}

/*!
 * @brief Get TX FIFO level.
 *
 * This function gets how many words are in the TX FIFO.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return TX FIFO word count.
 */
static inline uint16_t QSPI_GetTxFIFOCount(QSPI_Type *base)
{
    return ((base->SPFIFO & QSPI_SPFIFO_TFCNT_MASK) >> QSPI_SPFIFO_TFCNT_SHIFT);
}

/*!
 * @brief Get RX FIFO level.
 *
 * This function gets how many words are in the RX FIFO.
 *
 * @param base QUEUEDSPI peripheral address.
 * @return RX FIFO word count.
 */
static inline uint16_t QSPI_GetRxFIFOCount(QSPI_Type *base)
{
    return ((base->SPFIFO & QSPI_SPFIFO_RFCNT_MASK) >> QSPI_SPFIFO_RFCNT_SHIFT);
}

/*!
 * @brief Set the transmit and receive FIFO watermark values.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param txWatermark The TX FIFO watermark value. Refer to qspi_txfifo_watermark_t for available values.
 * @param rxWatermar The RX FIFO watermark value. Refer to qspi_rxfifo_watermark_t for available values.
 */
static inline void QSPI_SetFifoWatermarks(QSPI_Type *base, uint16_t txWatermark, uint16_t rxWatermark)
{
    base->SPFIFO = (base->SPFIFO & (~(QSPI_SPFIFO_RFWM_MASK | QSPI_SPFIFO_TFWM_MASK))) |
                   (QSPI_SPFIFO_TFWM(txWatermark) | QSPI_SPFIFO_RFWM(rxWatermark));
}

/*!
 * @brief Get the transmit and receive FIFO watermark values.
 *
 * @param base QUEUEDSPI peripheral address.
 * @param pu8TxWatermark The TX FIFO watermark value.
 * @param pu8RxWatermark The RX FIFO watermark value.
 */
static inline void QSPI_GetFifoWatermarks(QSPI_Type *base, uint8_t *pu8TxWatermark, uint8_t *pu8RxWatermark)
{
    assert((NULL != pu8RxWatermark) || (NULL != pu8TxWatermark));

    *pu8TxWatermark = ((base->SPFIFO & QSPI_SPFIFO_TFWM_MASK) >> QSPI_SPFIFO_TFWM_SHIFT);
    *pu8RxWatermark = ((base->SPFIFO & QSPI_SPFIFO_RFWM_MASK) >> QSPI_SPFIFO_RFWM_SHIFT);
}

/*!
 * @brief Empty the QUEUEDSPI RX FIFO.
 *
 * @param base QUEUEDSPI peripheral address.
 */
static inline void QSPI_EmptyRxFifo(QSPI_Type *base)
{
    while ((base->SPFIFO & QSPI_SPFIFO_RFCNT_MASK) != 0U)
    {
        (void)base->SPDRR;
    }
}

/* @} */

/*!
 * @name Transactional Helper Apis to extract information from handle
 * @{
 */

/*!
 * @brief Extract Base Address from handle for master or slave handle
 *
 */
#define QSPI_TRANSFER_GET_BASE(handle) (handle->base)

/*!
 * @brief Extract user data from handle for master or slave handle
 *
 */
#define QSPI_TRANSFER_GET_USER_DATA(handle) (handle->pUserData)

/* @} */

/*!
 * @name Transactional Master
 * @{
 */

/*!
 * @brief Initialize the QUEUEDSPI master handle.
 *
 * This function initializes the QUEUEDSPI handle, which can be used for other QUEUEDSPI transactional APIs. Usually,
 * for a specified QUEUEDSPI instance, call this API once to get the initialized handle.
 *
 * @note If only use the QSPI_MasterTransferBlocking, this API is not necessary be called.
 *
 * @param psHandle QUEUEDSPI handle pointer to qspi_master_transfer_handle_t.
 * @param pfCallback QUEUEDSPI callback.
 * @param pUserData Callback function parameter.
 */
void QSPI_MasterTransferCreateHandle(QSPI_Type *base,
                                     qspi_master_transfer_handle_t *psHandle,
                                     qspi_master_transfer_callback_t pfCallback,
                                     void *pUserData);

/*!
 * @brief Polling method of QUEUEDSPI master transfer.
 *
 * This function transfers data using a polling method for master. This is a blocking function,
 * which does not return until all transfers have been completed.
 *
 * @param psXfer Pointer to the qspi_transfer_t structure.
 * @return status of status_t.
 */
status_t QSPI_MasterTransferBlocking(QSPI_Type *base, qspi_transfer_t *psXfer);

/*!
 * @brief Interrupt method of QUEUEDSPI master transfer.
 *
 * This function transfers data using interrupts for master. This is a non-blocking function,
 * which returns right away. When all data is transferred, the callback function is called.
 *
 * @param psHandle QUEUEDSPI handle pointer to qspi_master_transfer_handle_t.
 * @param psXfer Pointer to the qspi_transfer_t structure.
 * @return status of status_t.
 */
status_t QSPI_MasterTransferNonBlocking(qspi_master_transfer_handle_t *psHandle, qspi_transfer_t *psXfer);

/*!
 * @brief Get the master transfer count.
 *
 * @param psHandle QUEUEDSPI handle pointer to qspi_master_transfer_handle_t.
 * @param pu16Count The number of bytes transferred by using the non-blocking transaction.
 * @return status of status_t.
 */
status_t QSPI_MasterTransferGetCount(qspi_master_transfer_handle_t *psHandle, uint16_t *pu16Count);

/*!
 * @brief Abort a transfer that uses interrupts for master.
 *
 * @param psHandle QUEUEDSPI handle pointer to qspi_master_transfer_handle_t.
 */
void QSPI_MasterTransferAbort(qspi_master_transfer_handle_t *psHandle);

/*!
 * @brief QUEUEDSPI Master IRQ handler function.
 *
 * This function processes the QUEUEDSPI transmit and receive IRQ.
 *
 * @param psHandle QUEUEDSPI handle pointer to qspi_master_transfer_handle_t.
 */
void QSPI_MasterTransferHandleIRQ(qspi_master_transfer_handle_t *psHandle);

/* @} */

/*!
 * @name Transactional Slave
 * @{
 */

